Revit 2026 API

# RebarShapeDrivenAccessorArrayLength Property

---

Identifies the distribution path length of rebar set.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ArrayLength { get; set; }
```
```vb
Public Property ArrayLength As Double
	Get
	Set
```
```cpp
public:
property double ArrayLength {
	double get ();
	void set (double value);
}
```
```fsharp
member ArrayLength : float with get, set
```

#### Property Value

Double The distribution path length of rebar set.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: the set length arrayLength isn't acceptable. |
| InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |
| InvalidOperationException | This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

#### Reference

RebarShapeDrivenAccessor Class

Autodesk.Revit.DB.Structure Namespace